Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: ཐེ་ཙོམ་མི་མངའ་མི་གཡོ་བརྟན་བརྙེས་ཤིང་། །སྲིད་པར་འཁོར་བརྟན་བཞིན་དུ་རབ་བཞུགས་པ། །རི་རབ་རི་ལ་ལྷ་ཡི་གནས་བཅས་བཞིན། །
en: You have no doubt and you have obtained an unmoving and stable state. Within existence, you sit firm with your retinue, Like the divine abodes on the king of mountains.

source: འདི་ལྟར་མི་གཡོ་བ་ལ་སྐྱབས་མཆི་ཞིང་། །མི་གཡོ་རི་ལྟ་བུར་ནི་འགྱུར་བར་བགྱི། །
en: “I take refuge in this steadfastness, And pledge to become myself like an unmoving mountain.

source: དེའི་ཚེ་འགུལ་དང་མི་འགུལ་ཞིང་མི་གནས། །མི་གཡོ་རི་རབ་ལྟ་བུར་འགྱུར་བར་བགྱི། །
en: At that point, I will be beyond shaking, But rest like an unmoving mountain.”

source: མ་སྨད་པས་ནི་དེ་ཡི་ཐུགས་ཆུད་ནས། །ཡིད་དུ་འོང་བའི་དབྱངས་ཀྱིས་ལུང་བསྟན་པ། །
en: The exalted one, who read his mind, Uttered this prophecy in a sweet-sounding tune:

source: བསྐལ་པ་སྟོང་ཕྲག་བརྒྱད་ཅུར་སྤྱད་བྱས་ནས། །མ་འོངས་པ་ཡིས་དུས་སུ་སངས་རྒྱས་འགྱུར། །
en: “In the future, after eighty thousand eons, You will become a buddha.

source: བདེ་བའི་ལམ་གྱིས་རྒྱལ་བར་འགྱུར་བ་སྟེ། །མཚན་ནི་ལེགས་མཐོང་ཞེས་བྱ་ཤིན་ཏུ་སྡུག །
en: “You will become a victorious one through a pleasant path. Your name shall be most beautiful: Valgudarśanā.

source: སྲོག་ཆགས་བྱེ་བ་སྟོང་ཕྲག་ཐར་བྱེད་ཅིང་། །བསིལ་བ་བདེ་བ་ཞི་བའི་ལམ་འགོད་འགྱུར། །
en: You will liberate billions of beings, And establish them on the cool, pleasant, and peaceful path.”

source: རྒྱལ་བས་གསུངས་པ་ཀླུ་དེས་ཐོས་ནས་སུ། །
en: When the nāga heard the Buddha’s words,

source: གཞལ་མེད་དགའ་བའི་སེམས་ནི་རབ་དང་བས། །ཉོན་མོངས་ཐམས་ཅད་སེལ་ཅིང་མ་སྨད་པ། །འགྲོ་བའི་འདྲེན་པ་ལ་ནི་ཕྱག་འཚལ་བྱེད། །
en: He felt a limitless joy and inspiration, Which cleared him of all disturbing emotions. He then prostrated to the exalted guide of beings.

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་ཨུད་པ་ལ་མིག་གིས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ཞུ་བ་ཞུས་པ།
en: Then the nāga king Utpala Eye addressed the Blessed One in these melodious verses:

source: མི་མཆོག་འདུལ་མཛད་གཟི་བརྗིད་མཐའ་ཡས་པ། །ཐུགས་རབ་ཞི་ཞིང་ཉེར་ཞི་ཕ་རོལ་གཤེགས། །
en: “Perfect being, tamer of others, boundless splendor! Your mind is peaceful and you have perfected peace.

source: ཞི་གནས་ཡོན་ཏན་རབ་ཞི་རྣམ་གྲོལ་བ། །ཞི་བ་མཁས་པ་བདེ་བར་གཤེགས་པ་གསུང་། །
en: In your liberation, you possess the peaceful qualities of tranquility. Skilled in peace, your speech is that of a blissful one.

source: ཁྱོད་སྲས་བྱང་ཆུབ་ཇི་ལྟར་སྤྱད་བགྱིས་ན། །ཞི་གནས་དགའ་ཞིང་ཞི་གནས་བསྟེན་པ་དང་། །ཞི་གནས་ལ་ནི་ཇི་ལྟར་མཁས་པར་འགྱུར། །
en: “Whatever your offspring, the bodhisattvas, do, They delight in tranquility, rely on tranquility, And become skilled in tranquility.

source: ཀུན་གཟིགས་མྱུར་དུ་བདག་གི་སོམ་ཉི་ཁུམ། །
en: Omniscient one, quickly, destroy my doubt!”

source: རྒྱལ་བ་ལ་ནི་ཀླུ་དེས་ཞུས་པ་དང་། །རྒྱལ་བས་ཨུད་པ་ལ་མིག་ལ་ལུང་བསྟན་པ། །
en: When that nāga had addressed the Victorious One, The Victorious One offered a teaching to King Utpala Eye:

source: གང་གིས་དགེ་བའི་ལས་ཀྱིས་ཡིད་འོང་བའི། །ཞི་གནས་ལ་ནི་ཤིན་ཏུ་བསླབས་པར་འགྱུར། །
en: “Bodhisattvas train in beautiful tranquility, Which is virtuous karma.

source: དེ་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་མཁས་པ་ནི། །སྤྱད་པ་སྤྱོད་ཚེ་སེམས་གཡོར་མི་བྱེད་ཅིང་། བསྐལ་པ་བྱེ་བར་ཞི་གནས་བསྟེན་བྱས་པ། །བྱང་ཆུབ་དམ་པ་དཔའ་མཆོག་སངས་རྒྱས་འགྱུར། །
en: “Therefore, a skilled bodhisattva Does not get distracted when engaged in activities. By relying on tranquility for millions of eons, One gains sacred awakening and becomes a buddha, the perfect hero.

source: དེ་ཡིད་རབ་ཞི་བྱང་ཆུབ་རྟོགས་ནས་སུ། །རྣམ་འདྲེན་འགྲོ་བ་ཞི་ལ་སྦྱོར་བྱེད་ཅིང་། །རབ་ཏུ་སེམས་ཞི་གཡོ་བར་མི་འགྱུར་ལ། །སེམས་ཅན་ཉོན་མོངས་མི་གཡོ་ཞི་བར་བྱེད། །
en: “Realizing awakening with a peaceful mind, The guide brings beings to peace. As his mind is peaceful and undisturbed, He causes the afflictions of beings to settle and become peaceful.”

source: དེས་པ་ཨུད་པ་ལ་མིག་གི་ཀླུ་དེས་ནི། །རྒྱལ་བས་ལེགས་པར་གསུངས་པའི་ཚིག་ཐོས་ནས། །
en: When the nāga Utpala Eye Heard the well-spoken words of the victorious one,

source: ཉོན་མོངས་ཀུན་གཡོ་ཡིད་ནི་ཞི་གྱུར་ཏེ། །
en: All afflictions disappeared and his mind became peaceful, And

source: བྱང་ཆུབ་མཆོག་རབ་སེམས་ནི་བསྐྱེད་གྱུར་ཏོ། །
en: he engendered the mind set on supreme awakening.

source: དེ་ཡི་ཞི་གནས་སེམས་ལ་བརྟེན་ནས་སུ། །བྱང་ཆུབ་སེམས་བསྐྱེད་རྒྱལ་བ་དེ་ལ་བསྟོད། །
en: Basing his mind on tranquility, He engendered the mind of awakening and praised the Victorious One:

source: ཁྱོད་ལ་བསྐྱེད་ནས་ཞི་གནས་རྟོགས་གྱུར་ཅིང་། །
en: “Thanks to you, I have realized tranquility!

source: ཤིན་ཏུ་ཡིད་ཞི་སངས་རྒྱས་འགྱུར་བར་བགྱི། །
en: With a mind perfectly at ease, I will become a buddha!”

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་དགའ་བོས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ཞུ་བ་ཞུས་པ།
en: Then the nāga king Nanda addressed the Blessed One in these melodious verses:

source: བདེ་བར་གཤེགས་པ་ཞི་གནས་ཐུགས་སུ་ཆུད། །རྒྱལ་བ་གང་ཟག་མཆོག་ལ་བདག་ཞུ་བ། །ཁྱོད་ཉིད་ལས་འཁྲུངས་བྱང་ཆུབ་རབ་གནས་པ། །མི་མཆོག་ཇི་ལྟར་ལྷག་མཐོང་དག་ལ་སྤྱད། །
en: “Blissful One, you have realized tranquility. Victorious One, perfect being, I ask you: Since you abide in perfect awakening, Perfect being, how should one practice special insight?”

source: མི་འདུལ་ཁ་ལོ་སྒྱུར་ལ་དགའ་བོས་ཞུས། །
en: So Nanda asked the leader, who has his being under control.

source: ཀླུ་དེའི་སྔོན་གྱི་མཐའ་ནི་གཟིགས་པས་ན། །དགེ་བའི་ལས་བསགས་པ་དག་ཐུགས་ཆུད་ནས། །
en: Perceiving the past existences of that nāga, He understood that the nāga had accumulated virtuous karma.

source: མི་འདུལ་ཁ་ལོ་སྒྱུར་བ་འདི་སྐད་གསུང་། །
en: Thus, the leader, who has his being under control, replied:

source: ཡེ་ཤེས་དམ་པ་བྱང་ཆུབ་མཆོག་བཙལ་ཕྱིར། །མ་ཞུམ་ཡིད་ཀྱིས་ནོར་དང་འབྲུ་དག་ལ། །སེར་སྣ་མེད་ཅིང་རྫས་མང་མི་ཉུང་དང་། །ཆུང་མ་དང་ནི་བདག་ཉིད་གཏོང་བར་བྱེད། །
en: “In order to search for sacred wisdom, perfect awakening, One must give, unstintingly and without miserliness, One’s wealth and grains, and other bountiful objects, Including one’s spouse and even oneself.

source: དེ་ཡིས་ལེགས་པའི་ལས་དེ་བྱས་པ་དང་། །གཏོང་བ་ཤིན་ཏུ་སྡུག་བསྔལ་བསྟེན་པས་ན། །ཡེ་ཤེས་དམ་པ་བདག་རྒྱལ་སངས་རྒྱས་འགྱུར། །
en: “Performing such wholesome actions, One must bear great hardships. Then one will master sacred wisdom and become a victorious buddha.

source: དེ་ནི་ལྷག་མཐོང་སྤྱད་པའི་འབྲས་བུ་ཡིན། །
en: That is the result of practicing insight.”

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་ཉེ་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ཞུ་བ་ཞུས་པ།
en: Then the nāga king Upananda addressed the Blessed One in these melodious verses:

source: འགྲོ་བ་ཀུན་གྱི་འདྲེན་ལ་བདག་ཞུ་བ། །ཁྱོད་སྲས་བྱང་ཆུབ་ཇི་ལྟར་སྤྱད་བགྱིས་ནཞི་གནས་ལྷག་མཐོང་མཉམ་པར་སྤྱོད་པ་དང་། །ཟང་ཟིང་མེད་ཞི་བྱང་ཆུབ་འཐོབ་འགྱུར་ལགས། །
en: “I ask the guide of all beings, Through what actions should your offspring, the bodhisattvas, Practice the equality of tranquility and insight, And attain the awakening of peace without disturbance?”

source: འདྲེན་པ་དེ་ལ་ཀླུ་དེས་ཞུས་པ་དང་། །ཞི་གནས་ལྷག་མཐོང་ཡང་དག་ལེན་མཁྱེན་པ། །ཐོགས་པ་མེད་པ་འདྲེན་པ་འདི་བརྙེས་པས། །དེ་ནི་བདེ་བར་གཤེགས་པའི་བསྟན་ལ་བཞག །
en: Thus the nāga asked the guide, Who knows the genuine practice of tranquility and insight. Since the guide had become unimpeded in this practice, He delivered this teaching of the blissful ones:

source: བྱང་ཆུབ་སེམས་དཔའ་གང་ཞིག་སྤྱད་སྤྱོད་ཚེ། །གཉིས་ཀའི་སྟོབས་འདི་མཉམ་པར་བསྟེན་པས་ན། །དེ་ནི་བྱེ་བ་ཁྲག་ཁྲིག་མཐའ་ཡས་ཞིང་། །འགྲོ་བའི་དོན་དུ་མཉམ་པར་རྣམ་པར་སྦྱོང་། །
en: “When bodhisattvas are engaged in activity, They must rely equally on the strength of both of these practices. In that case, for the sake of others, they will purify equally A quintillion realms.

source: བསྐལ་པ་བྱེ་བ་མང་པོ་དེ་འཚང་རྒྱ། །
en: “After many millions of eons they will awaken,

source: ཞིང་གི་དམ་པ་དག་ཀྱང་འགོད་འགྱུར་ཏེ། །
en: And take their seat in perfect realms.

source: དེའི་མཐའ་བསྔགས་པ་བསྐལ་པ་བྱེ་མང་དུ། །སངས་རྒྱས་བྱེ་བས་ཟད་པར་དེ་མི་སྤྱོད། །
en: This result will be praised for millions of eons, Uninterruptedly by millions of buddhas.”

source: དེ་ཚེ་ཀླུ་ཡི་བདག་པོ་ཉེ་དགའ་ཡིས། །ཐེག་པ་མཉམ་པའི་བསྔགས་པ་ཐོས་ནས་སུ། །
en: At that point, as the nāga king Upananda Heard this praise of the equality of the vehicles,

source: གཞལ་དུ་མེད་པའི་དགའ་བས་སེམས་བདེ་ནས། །
en: A boundless joy and happiness arose in him, And

source: བྱང་ཆུབ་མཆོག་གི་སེམས་རབ་བསྐྱེད་གྱུར་ཏོ། །
en: he engendered the mind set on perfect awakening.

source: འཇིག་རྟེན་ཕན་ཕྱིར་བྱང་ཆུབ་དེ་ལུང་བསྟན། །
en: For the benefit of the world, the Buddha then gave a prophecy of awakening:

source: མ་འོངས་དུས་སུ་སངས་རྒྱས་འགྱུར་བ་སྟེ། །མིང་ནི་རྒྱལ་བ་འདྲེན་པ་ཀུན་སྤྱན་ནོ། །
en: “In the future you will be a buddha, And your name shall be Victorious Guide with All-Seeing Eyes.

source: སྲོག་ཆགས་བྱེ་བ་སྟོང་ཕྲག་ཐར་བར་བྱེད། །
en: You will liberate billions of beings.”

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ཞུ་བ་ཞུས་པ།
en: Then the nāga king Anavatapta addressed the Blessed One in these melodious verses:

source: བདེ་གཤེགས་ཁྱོད་སྲས་ཇི་ལྟར་སྤྱད་བགྱིས་ན། །འགྲོ་བའི་དོན་དུ་ཕན་པ་ཚོལ་བྱེད་ཅིང་། །བྱང་ཆུབ་བླ་མ་ཚོལ་ལ་མི་སྐྱོ་བ། །རྐང་གཉིས་དམ་པ་མཆོག་གིས་དེ་ལུང་སྟོན། །
en: “Blissful One, please teach how your offspring should act, As they strive to be of help for others’ sake, And work untiringly to attain the highest awakening. Perfect and sacred man, please teach this!”

source: མི་ཡི་ཁྱུ་མཆོག་ལ་ནི་ཀླུས་ཞུས་པ། །
en: Thus the leader of men was asked by the nāga.

source: ཀླུ་ཡི་བདག་པོའི་བསམ་པ་ཐུགས་ཆུད་དེ། །ཐུབ་པ་སྔོན་མཐའ་སྦྱོར་ལ་མི་འཇིགས་པས། །ཀླུ་ཡི་བདག་པོའི་ཐེ་ཚོམ་ལུང་བསྟན་པ། །
en: Knowing the nāga king’s mind, The sage was not shy to speak of past endeavors, And thus he addressed the doubts of the nāga king:

source: བྱང་ཆུབ་ཞི་བ་སྤྱད་པ་སྤྱོད་འདོད་པ། །དེས་ཤིང་ཉམས་པ་མེད་པར་སྤྱོད་པ་དང་། །བདག་དང་གཞན་དག་ལ་ཡང་མི་གནོད་ཅིང་། །སེར་སྣ་མེད་ཅིང་གཏོང་ལྡན་རྒྱལ་བ་ཡིན། །
en: “If one wishes to engage in peaceful awakening, One’s actions must be gentle and unimpaired. One must be free from harming both oneself and others, And be generous without miserliness—such is a victorious one.

source: དེ་ཡིས་ལེགས་པའི་ལས་དེ་བྱས་པས་ན། །འགྲོ་བ་གང་གི་འཁོར་བར་བདེ་འདོད་ལ། །དེས་ཤིང་ཐམས་ཅད་དུ་ནི་སྙིང་རྗེར་ལྡན། །
en: “If one can act in such a fine way, One will be gentle and compassionate to any being Who longs for pleasure in saṃsāra.

source: ནོར་བྱིན་པས་ནི་སྡུད་པ་བྱེད་པར་འགྱུར། །
en: By giving wealth to others, that summarizes the practice.

source: དེ་ཡིས་ལེགས་པའི་ལས་དེ་བྱས་པས་ན། །ནམ་དུའང་སྐྱེ་བའི་སྡུག་བསྔལ་མྱོང་མི་འགྱུར། །རྟག་ཏུ་བདེ་བས་སྐྱེ་བོ་བདེར་འགོད་ལ། །
en: “If one can act in such a fine way, One will never feel any suffering of birth, But always joyfully bring happiness to others.

source: ཁ་ན་མ་ཐོ་མེད་ཅིང་གནས་ཞིར་འཇོག །
en: One will be free from negativity and join the abodes of peace.”

source: སྟོན་པའི་གསུང་གིས་ཀླུ་དེ་བསྐུལ་བས་ན། །མཆོག་ཏུ་དགའ་བས་སེམས་ནི་བདེར་འགྱུར་ཏེ། །
en: When the teacher had inspired the nāga in this way, The nāga’s mind was filled with perfect happiness and joy.

source: དེ་ཡིས་སྐད་ཅིག་ས་ལ་པུས་བཙུགས་ནས། །
en: Immediately he knelt on the ground, And

source: ཚིགས་བཅད་སྣ་ཚོགས་དག་གིས་རྒྱལ་བསྟོད་པ། །
en: praised the Victorious One in these verses:

source: གཽ་ཏམ་འཇིག་རྟེན་ཀུན་ན་མཉམ་མེད་དེ། །
en: “ Gautama , you are unequaled in all worlds!

source: འགྲོ་བ་ཟིལ་མནན་བདེ་གཤེགས་ལྷང་ངེ་བ། །
en: You outshine others; Blissful One, you are resplendent.

source: ཁྱོད་ཀྱི་ཞལ་དུ་ལྷར་བཅས་འགྲོ་ཀུན་བལྟ། །
en: Everyone, including the gods, admires your face.

source: ཐལ་མོ་སྦྱར་ནས་སྐྱབས་སུ་མཆི། །
en: With my palms joined, I take refuge in you.

source: བྱང་ཆུབ་མཆོག་གི་ཡིད་ནི་བསྐྱེད་བགྱི་ཞིང་། །
en: “I engender the mind set upon supreme awakening.

source: འདི་ལྟར་བདེ་གཤེགས་ཁྱོད་ཀྱི་ཡེ་ཤེས་དང་། །སྟོན་པ་ཁྱོད་ཀྱིས་ཐེ་ཙོམ་བསལ་བ་ལྟར། །བདག་ཀྱང་ཐོས་ནས་འཇིག་རྟེན་ཐེ་ཙོམ་བསལ། །
en: Blissful One, just as you have wisdom, And, Teacher, just as you have cleared away all doubts, May I hear your teaching and clear away all the world’s doubts!”

source: དེ་ནས་དེའི་སྟོན་གཞལ་མེད་བྱང་ཆུབ་ཕྱིར། །ཡིད་ནི་ཤིན་ཏུ་དགྱེས་ནས་བཀའ་སྩལ་པ། །
en: Then, considering immeasurable awakening, His teacher said with a joyful mind,

source: འཇིག་རྟེན་ཕན་ཕྱིར་འདྲེན་པར་འགྱུར་བ་ཡི། །མི་མཆོག་མིང་ནི་དབང་པོ་ཆེན་པོའོ། །
en: “To benefit the world you will become a guide— A supreme being known as Great Ruler.”

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་ཨེ་ར་པ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ཞུ་བ་ཞུས་པ།
en: Then the nāga king Elarāvaṇa addressed the Blessed One in these melodious verses:

source: འཇིག་རྟེན་དཔག་མེད་མང་པོའི་སྐྱབས་ཀྱི་མཆོག །རྒྱལ་བ་ཐེ་ཚོམ་གཅོད་ལ་ཞུ་བགྱི་བ། །
en: “You are the supreme refuge in endless worlds! Victorious One, I ask you the following to clear away my doubt:

source: བྱང་ཆུབ་སེམས་དཔས་སུག་ལས་ཅི་བགྱིས་ནསངས་རྒྱས་མངོན་དུ་ལྷན་ཅིག་ཕྲད་པ་འཐོབ། །
en: Through what activity will a bodhisattva Truly come to meet the Buddha?”

source: འཇིག་རྟེན་མགོན་པོ་དེ་ལ་ཀླུས་ཞུས་ནས། །
en: When the nāga king asked this of the protector of the world,

source: འཇིག་རྟེན་ཕན་ཕྱིར་འདྲེན་པས་ལུང་བསྟན་པ། །
en: The guide gave this teaching to benefit the world:

source: སེམས་ཅན་རྒྱུད་ལ་ཉོན་མོངས་རྣམ་རིག་དང་། །ཡོངས་སུ་དུལ་བའི་ཡིད་ནི་རྣམ་ཤེས་ནས། །འགྲོ་ལ་ཕན་ཕྱིར་སྙིང་རྗེ་བསྐྱེད་ནས་སུ། །བྱང་ཆུབ་མཆོག་གི་དོན་དུ་སྤྱད་པ་སྤྱོད། །
en: “One should know the afflictions in others, And also the gentle mind." “Then, develop compassion to benefit others, And act for the sake of supreme awakening.

source: བདག་དང་རྒྱལ་བར་ཇི་ལྟར་ཕྲད་སྙམ་ནས། །ཐབས་ལ་མཁས་པར་མངོན་པར་རབ་གནས་ཏེ། །
en: Thinking, ‘How will I meet the Victorious One?’ One must be skilled in means.

source: རྒྱལ་བ་རྣམས་དང་བདེ་གཤེགས་མྱ་ངན་འདས། །སྐུ་གདུང་དག་ལ་གཞལ་མེད་མཆོད་བྱེད་ཅིང་། །རྣམ་གྲོལ་ཡིད་ཀྱིས་སྨོན་ལམ་འདེབས་པར་བྱེད། །
en: “When victorious ones and blissful ones pass into nirvāṇa, One must make boundless offerings at their relics. With a mind set upon liberation, one must make aspirations.

source: དེ་ཡིས་ལེགས་པའི་ལས་དེ་བྱས་པས་ན། །རྟག་ཏུ་སངས་རྒྱས་མངོན་པར་ཕྲད་འཐོབ་སྟེ། །
en: “If one is able to engage in such fine activity, One will always meet the Buddha.

source: རྒྱལ་བ་མངོན་སུམ་མཆོད་པ་བྱས་ནས་སུ། །བྱང་ཆུབ་དགའ་བ་འོད་ལྡན་རེག་པར་འགྱུར། །
en: By worshiping the Victorious One, One will reach the luminous joy of awakening.”

source: སངས་རྒྱས་ཀྱིས་ནི་ལེགས་གསུངས་ཚིག་ཐོས་ནས། །ཨེ་ར་བ་ན་ཀླུ་ནི་ཡིད་མགུ་སྟེ། །
en: Upon hearing the well-spoken words of the Buddha, The nāga Elarāvaṇa was delighted.

source: དད་པའི་ཡིད་ཀྱིས་སངས་རྒྱས་མངོན་བསྟོད་པ། །
en: with a trusting mind he praised the Buddha:

source: མི་འདུལ་ཁ་ལོ་སྒྱུར་ལ་ཕྱག་འཚལ་ལོ། །
en: “Leader who tames beings, I prostrate to you!

source: ཁྱོད་ཀྱིས་བདག་གི་སོམ་ཉི་ཐེ་ཚོམ་བསལ། །
en: You clear away my uncertainty and doubt.

source: བྱང་ཆུབ་དོན་དུ་ཡིད་འདི་བསྐྱེད་བགྱི་སྟེ། །
en: I will engender this mind for the sake of awakening.

source: སྡུག་བསྔལ་མཐར་བགྱིད་སངས་རྒྱས་འགྱུར་བར་བགྱི། །
en: In order to end suffering, I will become a buddha!”

source: གང་ཟག་བདག་གིས་ཀླུ་ཡི་བདག་པོ་ཡི། །བསམ་པ་ཐུགས་ཆུད་བྱང་ཆུབ་ལུང་བསྟན་པ། །
en: The lord of men, who knew the thoughts Of that nāga king, then gave a prophecy of his awakening:

source: བསྐལ་པ་བྱེ་བ་བརྒྱད་ཅུ་རྩ་བཞི་རུ། །སྤྱད་པ་སྤྱོད་ནས་དེ་ནས་སངས་རྒྱས་འགྱུར། །
en: “After eight hundred forty million eons of being engaged in activity, You will become a buddha.

source: མི་མཆོག་མཚན་ནི་ཐམས་ཅད་སྒྲོལ་བ་སྟེ། །
en: “The name of this supreme being will be Liberator of All.

source: དེ་ཡི་རིང་བསྲེལ་མང་པོར་འགྱུར་བ་སྟེ། །
en: He will leave many relics, And

source: སྐྱེ་བོ་མང་པོ་མཐོ་རིས་འགྲོ་བར་འགྱུར། །
en: many beings will go to the higher realms.”

source: ཀླུ་དེ་སྟོན་པའི་གསུང་གིས་དགའ་གྱུར་ནས། །འཇིག་རྟེན་ཕན་མཛད་རྣམ་འདྲེན་མངོན་བསྟོད་པ། །
en: When the nāga heard the teacher’s words he was delighted, And praised the guide who benefits the world:

source: ཁྱོད་ཀྱིས་འགྲོ་བའི་དོན་ནི་རྒྱ་ཆེར་མཛད། །
en: “You benefit beings greatly!

source: སྡུག་བསྔལ་མཐར་མཛད་སངས་རྒྱས་ཕྱག་འཚལ་ལོ།། །།
en: I prostrate to the Buddha who brings an end to suffering!”

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་ཚིབ་པའི་བུས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ཞུ་བ་ཞུས་པ།
en: Then the nāga king Encompassing Son asked the Blessed One in these melodious verses:

source: ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་དོན་སླད་དུ། །འཇིག་རྟེན་དོན་མཛད་རྣམ་འདྲེན་ལ་ཞུ་བ། །
en: “For the sake of everyone, including the gods, I ask of the guide who benefits beings:

source: སྤྱད་པ་སྤྱོད་ཚེ་སུག་ལས་ཅི་བགྱིས་པས། །མ་རྟོགས་རྟོགས་ནས་རྒྱལ་བ་རྣམ་འདྲེན་འགྱུར། །
en: In the course of training, what deeds led you To realize what was not realized and become a victorious guide?”

source: ཚིབ་པའི་བུ་དེས་རྒྱལ་ལ་མངོན་ཞུས་ནས། །ཉོན་མོངས་ཐམས་ཅད་བསལ་བས་ལུང་བསྟན་པ། །
en: Encompassing Son inquired thus of the Victor, Who, having dispelled all afflictions, replied,

source: དགེ་བའི་ལས་ཀྱིས་འབྲས་བུ་ཡིད་འོང་ཞིང་། །ཉོན་མོངས་བཅོམ་པས་དེས་ན་རྒྱལ་ཞེས་བྱ། །
en: “Virtuous deeds lead to pleasant results. Having subdued the afflictions I am known as ‘victorious.’

source: དེ་ནི་འགྲོ་ཀུན་ཚེ་དང་སངས་རྒྱས་ལ། །མཆོག་ཏུ་དང་བ་དག་གིས་སེམས་ཀྱང་ཤེས། །
en: “With utter admiration for all living beings And the Buddha, I came to understand the mind.

source: དེ་ཡིས་ལས་ཀྱི་ལམ་དེ་བྱས་པས་ན། །འགྲོ་བའི་རྟག་པ་རྒྱལ་བ་དག་ཏུ་འགྱུར། །
en: When then I followed through in my actions, I became a victor, an eternal being.”

source: དེ་ཡིས་རྒྱལ་བའི་བཤད་པ་ཐོས་ནས་སུ། །འགྲོ་བ་ཐམས་ཅད་ལ་ནི་དད་པར་བྱས། །
en: When he heard the Victor’s words He felt faith in all beings and

source: དེ་ཚེ་དེ་ཡིས་དགེ་བ་བྱས་པས་ན། །འདི་ཡི་སྨོན་ལམ་བཏབ་ལྟར་བདག་འགྱུར་རོ། །
en: prayed, “Just as he was virtuous at that time, And formed aspirations, may I become the same.”

source: དེ་ནས་འཇིག་རྟེན་མགོན་པོས་དེ་ལུང་བསྟན། །མི་མཆོག་སངས་རྒྱས་སུ་ནི་འགྱུར་བ་སྟེ། །
en: The protector of the world then prophesied: “You will become a buddha, supreme among men.

source: སྲོག་ཆགས་བྱེ་བ་སྟོང་ཕྲག་ཐར་བྱེད་ཅིང་། །སྤྱད་པ་སྤྱོད་ཚེ་རྒྱལ་བ་མངོན་པར་བསྟོད། །
en: As you then liberate billions of beings And carry out your activity, you will be praised as a victor.”

source: སྟོན་པའི་གསུང་གིས་ཀླུ་དེ་དགའ་གྱུར་ནས། །སངས་རྒྱས་ལ་ནི་དད་བསྐྱེད་མངོན་བསྟོད་པ། །
en: Delighted by what the Teacher had said, The nāga developed faith in the Buddha and praised him:

source: འགྲོ་བ་ཐར་མཛད་སངས་རྒྱས་ཕྱག་འཚལ་ལོ། །
en: “Homage to the Buddha who liberates beings!

source: བསམ་ཡས་བདེ་གཤེགས་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to the inconceivable Blissful One!”

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་ནག་པོས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ཞུ་བ་ཞུས་པ།
en: Next the nāga king Kāla asked the Blessed One in these melodious verses:

source: དྲང་སྲོང་ཆེན་པོ་སྐྱབས་མཆོག་དཔག་ཏུ་མེད། །སྐྱོན་དང་བྲལ་ཞིང་ཡོན་ཏན་མཆོག་བརྙེས་པ། །སྟོབས་བཅུའི་འཇིགས་པས་རྣམ་གནོན་ཁྱོད་ལ་ནི། །བྱང་ཆུབ་ཞི་སྤྱོད་མཁས་པ་རབ་གནས་ཞུ། །
en: “O great sage, unfathomable, supreme refuge, You are flawless and have attained supreme qualities, You thwart with the menace of your ten powers, And you dwell in your expertise in awakened peaceful action . I ask of you:

source: དེས་པའི་ཉོན་མོངས་ཇི་ལྟར་བསལ་བ་དང་། །རྒྱལ་བའི་མཆོག་ཉིད་ཇི་ལྟར་བསྒོམ་པར་བགྱི། །
en: “How do the gentle ones dispel the afflictions? How does one train in the excellence of the victors?

source: བདུད་ཀྱི་སྤྱོད་ཡུལ་དེ་དག་ཇི་ལྟར་སྤང་། །
en: How to abandon the domain of evil?

source: སངས་རྒྱས་སྤྱོད་ཡུལ་དག་ལ་ཇི་ལྟར་སྤྱད། །
en: How to engage in the domain of the buddhas?”

source: རྒྱལ་བ་ལ་ནི་ཀླུ་དེས་ཞུས་པ་དང་། །ཇི་ལྟར་བདེ་གཤེགས་སྤྱོད་ཡུལ་སྤྱད་པ་དང་། །ཇི་ལྟར་བདུད་ཀྱི་སྤྱོད་ཡུལ་སྤང་བ་དག །ལམ་གཉིས་ཤིན་ཏུ་མཁྱེན་པས་རབ་ཏུ་བསྟན། །
en: The nāga asked the Blessed One thus, To teach what he clearly understood of the two paths: How to engage in the domain of the blissful ones And how to abandon the domain of evil.

source: སྟོན་པ་ལ་ནི་ཀླུ་བདག་དེས་ཞུས་ནས། །
en: As the nāga lord had inquired in this way,

source: དེ་ཡི་བསམ་པ་ཐུགས་ཆུད་ལུང་བསྟན་པ། །
en: The Teacher was aware of his thoughts and replied,

source: མི་མཁས་གང་དག་སེམས་ཅན་འདུ་ཤེས་སྤྱོད། །དེ་དག་ནག་པོའི་རྩ་ལག་སྤྱོད་ཡུལ་སྤྱོད། །
en: “The unwise who entertain the idea of ‘beings’ Are in the domain of kinship with darkness.

source: གང་དག་སེམས་ཅན་མེད་ཅིང་ཡིད་མི་གནས། །དེ་དག་ཐམས་ཅད་གཟིགས་པའི་སྤྱོད་ཡུལ་སྤྱོད། །
en: “Those whose minds do not so dwell, for whom there are no beings, Are engaged in the domain of the all-seeing state.

source: ནག་པོའི་རྩ་ལག་དག་ལས་རྒྱལ་ནས་སུ། །བྱང་ཆུབ་བླ་མེད་ཞི་བ་དེས་ཐོབ་བོ། །
en: They conquer the kinsmen of darkness And achieve the peaceful state of unexcelled awakening.”

source: སྟོན་པའི་གསུང་གིས་ཀླུ་དེ་དགའ་གྱུར་ནས། །བདུད་ཀྱི་སྤྱོད་ཡུལ་མྱུར་བར་རྣམ་སྤངས་ཏེ། །
en: Delighted by the Teacher’s words, The nāga soon abandoned the domain of evil.

source: སངས་རྒྱས་ཐམས་ཅད་གཟིགས་ལྟར་སྤྱོད་ཡུལ་དག །བསྟེན་པས་དེ་ནི་མྱུར་དུ་རྒྱལ་བར་འགྱུར། །
en: Pursuing the domain of the all-seeing buddhas, He swiftly became victorious.

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་གཽ་ཏ་མས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ཞུ་བ་ཞུས་པ།
en: Next the nāga king Gautama presented a question to the Blessed One in these melodious verses:

source: ཁ་ལོ་སྒྱུར་མཆོག་ཁྱོད་ལ་ཞུ་བགྱི་བ། །
en: “Eminent helmsman, I ask you:

source: འདྲེན་པ་ཁྱོད་སྲས་ཇི་ལྟར་སྤྱད་བགྱིས་ནསཀླུ་ཡི་སྐྱེ་གནས་དག་ནི་གཅོད་བགྱིད་ཅིང་། །སངས་རྒྱས་ཚུལ་གྱི་མྱུ་གུ་བསྐྱེད་པར་བགྱིད། །
en: How, Guide, should your child practice In order to cut off rebirth as a nāga, and instead Produce the sprout of the way of the buddhas?”

source: བདེ་བར་གཤེགས་ལ་ཀླུ་དེས་ཞུས་པ་དང་། །དེ་ཡི་བསམ་པ་ཐུགས་ཆུད་ལུང་བསྟན་པ། །
en: When the nāga had asked this, the Blissful One, Who was aware of his thoughts, responded,

source: སེམས་ཅན་མེད་ལ་རྒྱལ་བའི་སྲས་སྤྱོད་ཅིང་། །བྱང་ཆུབ་སེམས་ལ་ནམས་ཀྱང་དེ་མི་གནས། །
en: “The Victor’s children act although there are no beings. They never dwell in the mind of awakening.

source: དེ་ནི་སྟོང་ཉིད་ཁོང་དུ་ཆུད་པ་ཡིན། །
en: “That is the realization of emptiness.

source: མཁས་པ་མཚན་མ་སྨོན་ལམ་རྣམ་སྤངས་ཤིང་། །
en: The wise give up signs and wishes.

source: མཛངས་པ་མི་དམིགས་པ་ལ་གནས་པ་དག །འདི་ནི་སངས་རྒྱས་ཆོས་མངོན་མྱུ་གུ་བསྐྱེད། །
en: The sagacious dwell without reference point. This is how to produce the sprout of the buddha’s higher knowledge.”

source: སྟོན་པའི་གསུང་གིས་ཀླུ་དེ་དགའ་གྱུར་ནས། །མི་དམིགས་པ་ལ་བརྟེན་པར་རབ་གནས་ཤིང་། །བདུད་ཀྱི་ཞགས་བཅིངས་དམ་པ་བཅད་ནས་སུ། །སངས་རྒྱས་ཚུལ་ལ་ཀླུ་ནི་རབ་ཏུ་གནས། །
en: The Guide’s words delighted the nāga, Who then dwelt without reference point, And cut the tight cord of evil that bound him. The nāga then abided by the way of the buddhas.

source: འཇིག་རྟེན་མཁས་པས་བྱང་ཆུབ་དེ་ལུང་བསྟན། །
en: The Sage of the World then prophesied his awakening:

source: མ་འོངས་དུས་སུ་སངས་རྒྱས་འགྱུར་བ་སྟེ། །རྣམ་ཐར་རྒྱལ་ཞེས་ཕྱོགས་སུ་རྣམ་གྲགས་ཤིང་། །
en: “In the future you will become a buddha, Your name, Victorious Liberation, renowned everywhere.

source: བདུད་ཀྱི་དབང་སོང་སྲོག་ཆགས་ཐར་བར་བྱེད། །
en: You will liberate beings under evil influence.”

source: སྟོན་པའི་གསུང་གིས་ཀླུ་དེ་དགའ་གྱུར་ནས། །ཐལ་མོ་སྦྱར་ནས་སངས་རྒྱས་ཕྱག་འཚལ་བྱེད། །
en: The Guide’s words pleased the nāga, Who brought his palms together and paid the Buddha homage:

source: ཁྱོད་ཀྱི་ལམ་བསྟན་པས་ན་སངས་རྒྱས་བསྟེན། །
en: “Since you have taught the path, I will follow the Buddha.

source: མི་མཆོག་ཐར་མཛད་ཞིང་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to you, liberating field, supreme among men!”

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་ཀམ་པ་ལའི་སྒྲས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ཞུ་བ་ཞུས་པ།
en: Then the nāga king Kambala asked the following of the Blessed One in these melodious verses:

source: ཟླ་བའི་འོད་ལྟར་དྲི་མེད་མཐུ་ཆེ་ཞིང་། །མི་མཆོག་རང་བྱུང་གྱུར་ལ་ཞུ་བགྱི་བ། །
en: “Powerful and immaculate as moonlight, I ask you, O self-arisen, supreme man,

source: རྣམ་འདྲེན་སྲས་ནི་ཇི་ལྟར་སྤྱད་བགྱིས་ནཕན་པར་འཇུག་ཅིང་རྗེས་སུ་སྐྱེ་བར་འགྱུར། །
en: How should a child of the Guide practice So as to engage with and be born into altruism?”

source: གལ་ཏེ་སྟོང་ཉིད་སྨོན་མེད་རྗེས་སོང་ཞིང་། །ཕུང་པོ་མཚན་མ་མི་ལྡན་བྲལ་བ་དང་། །ནམ་མཁའ་འདྲ་བའི་ཆོས་དང་རྣམ་ཤེས་ན། །
en: “If he pursues emptiness and absence of wishes, Becomes free of the aggregates devoid of marks, And comprehends the space-like Dharma,

source: ཕ་ཡི་ལམ་དུ་བུ་ཡང་རྗེས་འགྲོ་འགྱུར། །
en: The child will follow in the father’s footsteps.”

source: སྟོན་པས་ལེགས་པར་གསུངས་པ་དེ་དགའ་ནས། །དམིགས་སུ་མེད་པ་ཡི་ནི་སེམས་བསྐྱེད་དོ། །
en: Delighted by the Teacher’s explanation, He engendered a mind-state free of reference point.
